app/views/users/show.html.erb


  <% @market.vendors.each do |vendor| %>
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."market_id" = ?  [["market_id", 24]]