app/views/vendors/show.html.erb

    <ul>
    <% @vendor.products.each do |product| %>
---
SELECT "products".* FROM "products" WHERE "products"."vendor_id" = ?  [["vendor_id", 1]]