app/controllers/markets_controller.rb

  def index
    @markets = Market.all
---
SELECT "markets".* FROM "markets"

  def show
    @market = Market.find(params[:id])
---
SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 2]]