app/controllers/markets_controller.rb

SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @market = Market.find(current_user.id)

INSERT INTO "markets" ("name", "address", "city", "state", "zip", "county", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @market = Market.create(name: params[:market][:name], address: params[:market][:address], city: params[:market][:city], county: params[:market][:county], state: params[:market][:state], zip: params[:market][:zip])

SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 5]]
---
  def edit
    @market = Market.find(params[:id])

SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "markets" SET "name" = ?, "updated_at" = ? WHERE "markets"."id" = ?  [["name", "Quincy Farmers Market!!!"], ["updated_at", "2016-10-05 22:23:36.564188"], ["id", 5]]
---
  def update
    @market = Market.find(params[:id])
    @market.update(name: params[:market][:name], address: params[:market][:address], city: params[:market][:city], county: params[:market][:county], state: params[:market][:state], zip: params[:market][:zip])