app/controllers/products_controller.rb

INSERT INTO "products" ("name", "vendor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Delicious Lox"], ["vendor_id", 3], ["created_at", "2016-10-06 03:09:45.188352"], ["updated_at", "2016-10-06 03:09:45.188352"]]
---
  def create
    Product.create(name: params[:product][:name], vendor_id: current_user.id)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1425]]
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Yummy Greens and Peas"], ["updated_at", "2016-10-06 03:13:53.161680"], ["id", 1425]]
---
  def update
    @product = Product.find(params[:id])
    @product.update(name: params[:product][:name])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1378]]
SELECT "sales".* FROM "sales" WHERE "sales"."product_id" = ?  [["product_id", 1427]]
DELETE FROM "sales" WHERE "sales"."id" = ?  [["id", 2241]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1378]]
---
  def destroy
    product = Product.find(params[:id])

    product.sales.each do |sale|
      sale.destroy
    end

    product.delete