app/controllers/products_controller.rb

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 3]]
---
  def create
    vendor_id = params[:vendor_id]
    vendor = Vendor.find(vendor_id)