app/controllers/sales_controller.rb

  def create
    @vendor = Vendor.find(params[:vendor_id])
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 3]]