app/controllers/sales_controller.rb

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 3]]
---
  def show
    @vendor = Vendor.find(current_user.id)

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 3]]
---
  def new
    @sale = Sale.new
    @vendor = Vendor.find(current_user.id)

INSERT INTO "sales" ("amount", "vendor_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["amount", 20011], ["vendor_id", 3], ["product_id", 1424], ["created_at", "2016-10-06 05:09:42.377418"], ["updated_at", "2016-10-06 05:09:42.377418"]]
---
  def create
    @sale = Sale.create(amount: (Float(params[:sale][:amount])*100).round, vendor_id: current_user.id.to_i, product_id: params[:sale][:product_id].to_i, purchase_time: DateTime.now)