app/controllers/users_controller.rb

SELECT "markets".* FROM "markets"
---
  def index
    @market = Market.new
    @markets = Market.all

SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 92]]
---
  def show
    @market = Market.find(params[:id])