app/controllers/vendors_controller.rb

  def create
    @myvendor = Vendor.new
    @myvendor.name = params[:vendor][:name]
    @myvendor.no_employees = params[:vendor][:no_employees]
    @myvendor.market_id = params[:id]
    @myvendor.save
---
INSERT INTO "vendors" ("name", "employees", "market_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Rachel's Clocks"], ["employees", 1], ["market_id", 0], ["created_at", "2016-10-05 16:53:24.484498"], ["updated_at", "2016-10-05 16:53:24.484498"]]