app/controllers/vendors_controller.rb

  def index
    @vendors = Vendor.all
---
SELECT "vendors".* FROM "vendors"

  def find_vendor
    return Vendor.find(params[:id].to_i)
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 1]]

  def find_market
    return Market.find(params[:id].to_i)
---
SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 1]]

  def find_product
    return Product.find(params[:product_id].to_i)
---
SELECT "products".* FROM "products" WHERE "products"."vendor_id" = ?  [["vendor_id", 1]]