app/views/markets/index.html.erb

SELECT "vendors".* FROM "vendors" WHERE "vendors"."market_id" = ?  [["market_id", 5]]
---

  <% @market.vendors.each do |vendor| %>