app/views/markets/show.html.erb

SELECT "vendors".* FROM "vendors" WHERE "vendors"."market_id" = ?  [["market_id", 2]]
---
      </tr>
      <% @market.vendors.each do |vendor| %>