app/views/sales/new.html.erb

    <%= f.label :product_id %>
    <%= f.collection_select :product_id, @vendor.products.all, :id, :name %>
---
SELECT "products".* FROM "products" WHERE "products"."vendor_id" = ?  [["vendor_id", 3]]