app/views/sales/show.html.erb


  <% @vendor.sales.each do |sale| %>
---
SELECT "sales".* FROM "sales" WHERE "sales"."vendor_id" = ?  [["vendor_id", 3]]